{
  "architectures": [
    "MUDDPythia"
  ],
  "auto_map": {
    "AutoConfig": "configuration_muddpythia.MUDDPythiaConfig",
    "AutoModelForCausalLM": "modeling_muddpythia.MUDDPythia"
  },
  "block_size": 2048,
  "bos_token_id": 0,
  "dense": true,
  "dense_type": "qkvr",
  "dim": 2048,
  "dynamic_dense": true,
  "eos_token_id": 0,
  "expand_last": true,
  "head_dim": 128,
  "intermediate_size": 8192,
  "is_training": false,
  "model_type": "muddpythia",
  "n_head": 16,
  "n_layer": 24,
  "n_local_heads": 16,
  "norm_eps": 1e-05,
  "rope_base": 10000,
  "rotary_pct": 0.25,
  "round64": true,
  "sepln": true,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.35.0",
  "use_gradient_checkpointing": false,
  "use_layer_cache": true,
  "use_linear_bias": true,
  "use_parallel_residual": true,
  "use_qk_norm": true,
  "vocab_size": 50432
}
